// 9. 최소편집 => 응용 돼서 많이 나옴
// 문자열 A와 문자열 B가 주어져 있을 때, 문자열 A를 문자열 B로 편집(삽입, 삭제, 대체)하여
// 바꾸려 한다.
// 이때 편집하는 최소 횟수를 구하는 프로그램을 작성하세요.
// 만약 문자열 A가 aabab이고 문자열 B가 babb라면 2회의 편집으로 바꿀 수 있다. 문자열
// aabab에서 제일 앞에 있는 a를 b로 대체하면 babab이고 네 번째 a를 삭제하면 된다.
// ▣ 입력설명
// 매개변수 s1에 첫 번째 문자열이 주어지고, 매개변수 s2에 두 번째 문자열이 주어집니다.
// 두 문자열의 길이는 1000을 넘지 않으며 대문자로 주어진다.
// ▣ 출력설명
// 최소 편집 횟수를 반환합니다.
// ▣ 매개변수 형식 1
// BAOBAB
// BACBA
// ▣ 반환값 형식 1
// 2

{
  function solution(s1, s2) {}
  //  console.log(solution("BAOBAB","BACBA"));
}
